; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared3 - mode
	image1 - mode
	thermograph2 - mode
	image5 - mode
	spectrograph0 - mode
	spectrograph4 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	GroundStation13 - direction
	Star12 - direction
	Star11 - direction
	GroundStation2 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image5)
	(calibration_target instrument0 Star12)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(supports instrument1 spectrograph4)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star11)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star17)
)
(:goal (and
	(pointing satellite1 Star5)
	(have_image Planet14 image5)
	(have_image Phenomenon15 spectrograph4)
	(have_image Phenomenon15 spectrograph0)
	(have_image Planet16 image5)
	(have_image Star17 image1)
	(have_image Star17 infrared3)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (turn_to satellite1 star11 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 star11)
   goals met: 0 of 7
4. (calibrate satellite1 instrument1 star11)
   added: (calibrated instrument1)
   goals met: 0 of 7
5. (turn_to satellite1 phenomenon15 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 7
6. (take_image satellite1 phenomenon15 instrument1 spectrograph0)
   added: (have_image phenomenon15 spectrograph0)
   goals met: 1 of 7
7. (take_image satellite1 phenomenon15 instrument1 spectrograph4)
   added: (have_image phenomenon15 spectrograph4)
   goals met: 2 of 7
8. (turn_to satellite1 star17 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 star17)
   goals met: 2 of 7
9. (take_image satellite1 star17 instrument1 image1)
   added: (have_image star17 image1)
   goals met: 3 of 7
10. (take_image satellite1 star17 instrument1 infrared3)
   added: (have_image star17 infrared3)
   goals met: 4 of 7
11. (turn_to satellite1 star5 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 star5)
   goals met: 5 of 7
12. (turn_to satellite0 star12 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star12)
   goals met: 5 of 7
13. (calibrate satellite0 instrument0 star12)
   added: (calibrated instrument0)
   goals met: 5 of 7
14. (turn_to satellite0 planet14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet14)
   goals met: 5 of 7
15. (take_image satellite0 planet14 instrument0 image5)
   added: (have_image planet14 image5)
   goals met: 6 of 7
16. (turn_to satellite0 planet16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet16)
   goals met: 6 of 7
17. (take_image satellite0 planet16 instrument0 image5)
   added: (have_image planet16 image5)
   goals met: 7 of 7
